УТ_для_edt/src/DataProcessors/смартКонструкторКП/смартКонструкторКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартКонструкторКП</name>
</mdclass:DataProcessor>

УТ_для_edt/src/InformationRegisters/СмартЗначенияСвойствФильтров/СмартЗначенияСвойствФильтров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СмартЗначенияСвойствФильтров</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.СмартФильтрыНоменклатуры</types>
    </type>
  </resources>
  <attributes>
    <name>ЗначениеСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСвойств</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СмартФильтрыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сегмент</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/AccumulationRegisters/СвободныеОстатки/СвободныеОстатки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СвободныеОстатки</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеСоСклада</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВРезервеПодЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВНаличииГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеСоСкладаГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>смартВРезервеПодЗаказГарантийные</name>
    <comment>++ #Б1376 смарт: Шляпников 19.11.2024 / Раздельный учет товаров. Гарантийные запчасти. Разработка документов и регистров.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ_для_edt/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартНазначенияСкладов/смартНазначенияСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартНазначенияСкладов</name>
  <comment>//++ #1351 смарт: Фролов 11.05.2023 //Разделение остатков по организациям в заказах</comment>
  <enumValues>
    <name>ГарантийныеЗапчастиНеДляПродажи</name>
  </enumValues>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>СкладДляВнутреннихНужд</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСклад</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыКоммерческихПредложенийКлиентам/СтатусыКоммерческихПредложенийКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКоммерческихПредложенийКлиентам</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Отменено</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>Ставка НДС 22%</comment>
  </enumValues>
  <enumValues>
    <name>НДС22_122</name>
    <comment>Расчетная ставка НДС 22/122</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартПечатающиеГоловки/смартПечатающиеГоловки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПечатающиеГоловки</name>
  <predefined>
    <items>
      <name>Epsoni1600U1</name>
      <description>Epson i1600-U1</description>
    </items>
    <items>
      <name>Epsoni3200A1</name>
      <description>Epson i3200-A1</description>
    </items>
    <items>
      <name>Epsoni3200U1</name>
      <description>Epson i3200-U1</description>
    </items>
    <items>
      <name>Konica1024A</name>
      <description>Konica 1024A</description>
    </items>
    <items>
      <name>RicohG5i</name>
      <description>Ricoh G5i</description>
    </items>
    <items>
      <name>RicohGEN5</name>
      <description>Ricoh GEN5</description>
    </items>
    <items>
      <name>RicohGEN6</name>
      <description>Ricoh GEN6</description>
    </items>
  </predefined>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.смартКонструкторОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <comment>//++ #Б-6420 смарт: Фролов 09.04.2026 //Доработка объектов Конструктора КП.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартКонструкторКП/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьДоступность();
	КПМенеджер = Пользователи.АвторизованныйПользователь();
	Валюта = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD.ВалютаЦены;
	ДатаКП = ТекущаяДатаСеанса();
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры 

&НаКлиенте
//++ #Б-3142 смарт: Фролов 21.04.2025 //Вывод SMART Конструктора в внешнюю обработку.
Процедура ПриОткрытии(Отказ)
	
	Если смартПользователи.РольДоступнаПользователю("смартИспользованиеSMARTКонструктор") 
		ИЛИ смартПользователи.РольДоступнаПользователю("ПолныеПрава") Тогда
		
		ВнешняяФорма = смартОбщегоНазначения.ПолучитьссылкуНаВнешнююОбработку("смартКонструкторКП");
		Если ЗначениеЗаполнено(ВнешняяФорма) Тогда
			
			ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ВнешняяФорма);
			ОткрытьФорму("ВнешняяОбработка." + ИмяОбработки + ".Форма");
			
			ЭтаФорма.Закрыть();
			
		КонецЕсли; 
		
	Иначе
		
		ЭтаФорма.Закрыть();
	
	КонецЕсли;

КонецПроцедуры //-- #Б-3142 смарт: Фролов 21.04.2025

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПриИзмененииОтбораНаФорме(Элемент)
	
	УстановитьВидимостьДоступность();
	
	Если Элемент.Имя = "БрендОтбор" Тогда
		Если БрендОтбор = ПолучитьБрендСпринтер() Тогда
			ОбновитьКонфигураторСпринтер();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступногоОборудованияПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("СформироватьПодвалКлиент", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриНажатииНаСсылкуПолезнойИнформации(Элемент)
	
	Если ЗначениеЗаполнено(Элемент.Подсказка) Тогда
		ЗапуститьПриложение(Элемент.Подсказка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокДоступногоОборудованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элементы.СписокДоступногоОборудования.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ВыбранноеОборудование = Элементы.СписокДоступногоОборудования.ТекущаяСтрока Тогда
		
		ОчиститьКП();
		ВыборДоступногоОборудованияСервер();
		УстановитьВидимостьДоступность();
		
	КонецЕсли;
	
	ОбновитьКартинкуПечатающейГоловкиНаФорме();
	
	ОбновитьСопутствующиеТоварыИДополнительныеОпции();
	
	РассчитатьИтоговоеКП();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонфигурацииСпринтер(Элемент)
	
	Если НЕ ЗначениеЗаполнено(БрендОтбор) Тогда
		БрендОтбор = ПолучитьБрендСпринтер();
	КонецЕсли;
	
	Если Элемент.Имя = "СпринтерФорматыПринтеровВыбрано" Тогда
		
		ТекущаяСтрока = Элементы.СпринтерФорматыПринтеров.ТекущаяСтрока;
		Таблица = СпринтерФорматыПринтеров;
		
	ИначеЕсли Элемент.Имя = "СпринтерПечатающиеГоловкиВыбрано" Тогда
		
		ТекущаяСтрока = Элементы.СпринтерПечатающиеГоловки.ТекущаяСтрока;
		Таблица = СпринтерПечатающиеГоловки;
		
	ИначеЕсли Элемент.Имя = "СпринтерОсновныеКонфигурацииВыбрано" Тогда
		
		ТекущаяСтрока = Элементы.СпринтерОсновныеКонфигурации.ТекущаяСтрока;
		Таблица = СпринтерОсновныеКонфигурации;
		ВыбранноеОборудование = Элементы.СпринтерОсновныеКонфигурации.ТекущиеДанные.ОсновнаяКонфигурация;
		ОбновитьСопутствующиеТоварыИДополнительныеОпции();
		ОбновитьКартинкуПечатающейГоловкиНаФорме();
		
	ИначеЕсли Элемент.Имя = "СпринтерЦветовыеКонфигурацииВыбрано" Тогда
		
		ТекущаяСтрока = Элементы.СпринтерЦветовыеКонфигурации.ТекущаяСтрока;
		Таблица = СпринтерЦветовыеКонфигурации;
		
	Иначе
		Таблица = Неопределено;
	КонецЕсли;
	
	Если НЕ Таблица = Неопределено Тогда
		
		Для каждого стрТаблица Из Таблица Цикл
			
			Если стрТаблица.ПолучитьИдентификатор() <> ТекущаяСтрока Тогда
				стрТаблица.Выбрано = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьКонфигураторСпринтер();
	
	РассчитатьИтоговоеКП();
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеОпцииПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьКартинкуДополнительныхОпцийНаФормеКлиент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СопутствующиеТоварыПриАктивизацииСтроки(Элемент)
	
	ПодключитьОбработчикОжидания("ОбновитьКартинкуСопутствующихТоваровНаФормеКлиент", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КПКлиентПриИзменении(Элемент)
	ПриИзмененииКПКлиентСервер();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеОпцииВыбраноПриИзменении(Элемент)
	
	РассчитатьИтоговоеКП();
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура СопутствующиеТоварыВыбраноПриИзменении(Элемент)
	
	РассчитатьИтоговоеКП();
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	РассчитатьИтоговоеКП();
	
КонецПроцедуры

&НаКлиенте
Процедура СпринтерКоличествоГоловПриИзменении(Элемент)
	
	ПроверитьСкорректироватьКоличествоГолов();
	РассчитатьИтоговоеКП();
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры

&НаКлиенте
Процедура СпринтерНужноЛиПечататьГлянецПриИзменении(Элемент)
	
	ОбновитьИнформациюПоПечатнымГоловкам();
	ПроверитьСкорректироватьКоличествоГолов();
	РассчитатьИтоговоеКП();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранноеОборудованиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбранноеОборудованиеПриИзменении(Элемент)
	
	БрендОтбор = Неопределено;
	ОчиститьКП();
	УстановитьВидимостьДоступность();
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаПодборПоПараметрам;
	
КонецПроцедуры

&НаКлиенте
Процедура КППартнерПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписокДоступногоОборудования(Команда)
	
	Элементы.СписокДоступногоОборудования.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКонфигураторСпринтер 
		И Элементы.СтраницаДополнительныеОпции.Доступность Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДополнительныеОпции;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДополнительныеОпции 
		И Элементы.СтраницаСопутствующиеТовары.Доступность Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСопутствующиеТовары;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаСопутствующиеТовары Тогда
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКПКлиента;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьКП(Команда)
	
	СформироватьКППоТекущимДанным();
	Элементы.СписокКП.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	
    ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"ВидОборудования",
																			ВидОборудованияОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ВидОборудованияОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"Бренд",
																			БрендОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(БрендОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"ФорматПринтера",
																			ФорматПринтераОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ФорматПринтераОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"ТехнологияПечати",
																			ТехнологияПечатиОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ТехнологияПечатиОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"ШиринаПечати",
																			ШиринаПечатиОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ШиринаПечатиОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"Оборудование.Материалы.Материал",
																			ВидМатериалаОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ВидМатериалаОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокДоступногоОборудования,
																			"Оборудование.Применения.Применяется",
																			ПроизводимаяПродукцияОтбор,
																			ВидСравненияКомпоновкиДанных.Равно,
																			,
																			ЗначениеЗаполнено(ПроизводимаяПродукцияОтбор),
																			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
																			
	Элементы.СтраницаКонфигураторСпринтер.Видимость = (ВыбранноеОборудование.Бренд = Справочники.смартПредопределенныеЗначения.Настройки.БрендСпринтер)
													ИЛИ (НЕ ЗначениеЗаполнено(ВыбранноеОборудование) И БрендОтбор = Справочники.смартПредопределенныеЗначения.Настройки.БрендСпринтер);
													
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокКП, "Клиент", КППартнер, ВидСравненияКомпоновкиДанных.Равно,, Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьПодвалКлиент() Экспорт
	
	СформироватьПодвал();
	
КонецПроцедуры
	
&НаСервере
Процедура СформироватьПодвал()
	
	Если Элементы.СписокДоступногоОборудования.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущееОборудование = Элементы.СписокДоступногоОборудования.ТекущаяСтрока;
	Если ТекущаяСтрокаСписка = ТекущееОборудование Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеОписание = СтрШаблон("%1%2Страница на сайте: %3", ТекущееОборудование.Описание, Символы.ПС, ТекущееОборудование.СтраницаНаСайте);
	
	МассивОчищаемыхГрупп = Новый Массив;
	МассивОчищаемыхГрупп.Добавить(Элементы.ГруппаПолезнаяИнформацияЛеваяКолонка);
	МассивОчищаемыхГрупп.Добавить(Элементы.ГруппаПолезнаяИнформацияСредняяКолонка);
	МассивОчищаемыхГрупп.Добавить(Элементы.ГруппаОстаткиДемозалыЛеваяКолонка);
	МассивОчищаемыхГрупп.Добавить(Элементы.ГруппаОстаткиДемозалыПраваяКолонка);
	
	Для каждого ОчищаемаяГруппа Из МассивОчищаемыхГрупп Цикл
		
		КоличествоЭлементов = ОчищаемаяГруппа.ПодчиненныеЭлементы.Количество();
		Для н = 1 По КоличествоЭлементов Цикл
			
			Элемент = ОчищаемаяГруппа.ПодчиненныеЭлементы.Получить(0);
			Элементы.Удалить(Элемент);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Середина = Окр(ТекущееОборудование.ПолезныеМатериалы.Количество() / 2);
	Счетчик = 0;
	Для каждого стрПолезныеМатериалы Из ТекущееОборудование.ПолезныеМатериалы Цикл
		
		Счетчик = Счетчик + 1;
		ИмяЭлемента = СтрШаблон("МатериалСсылка%1", Формат(Счетчик, "ЧГ="));
		ИмяГруппы = СтрШаблон("ГруппаСсылка%1", Формат(Счетчик, "ЧГ="));
		Колонка = ?(Счетчик <= Середина, Элементы.ГруппаПолезнаяИнформацияЛеваяКолонка, Элементы.ГруппаПолезнаяИнформацияСредняяКолонка);
		
		Группа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Колонка);
		Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		Группа.ОтображатьЗаголовок = Ложь;
		Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		Элемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = стрПолезныеМатериалы.ВидМатериала;
		
		Элемент = Элементы.Добавить(ИмяЭлемента+"С", Тип("ДекорацияФормы"), Группа);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = стрПолезныеМатериалы.Заголовок;
		Элемент.Гиперссылка = Истина;
		Элемент.Подсказка = стрПолезныеМатериалы.АдресСсылки;
		Элемент.УстановитьДействие("Нажатие", "ПриНажатииНаСсылкуПолезнойИнформации");
		
	КонецЦикла;
	
	ОстаткиВДемоЗалах = ПолучитьОстаткиОборудованияВДемоЗалах(ТекущееОборудование);
	Если ОстаткиВДемоЗалах.Количество() = 0 Тогда
		Элементы.НадписьНаличиеВДемоЗалах.Заголовок = "Нет в демозалах !";
		Элементы.НадписьНаличиеВДемоЗалах.ЦветТекста = WebЦвета.ТемноКрасный;
	Иначе
		Элементы.НадписьНаличиеВДемоЗалах.Заголовок = "Есть в демозале !";
		Элементы.НадписьНаличиеВДемоЗалах.ЦветТекста = WebЦвета.ТемноЗеленый;
	КонецЕсли;
	
	Счетчик = 0;
	Для каждого стрОстатокНаСкладе Из ОстаткиВДемоЗалах Цикл
		
		Счетчик = Счетчик + 1;
		
		ИмяЭлемента = СтрШаблон("ДемозалОстаток%1", Формат(Счетчик, "ЧГ="));
		
 		Элемент = Элементы.Добавить(ИмяЭлемента, Тип("ДекорацияФормы"), Элементы.ГруппаОстаткиДемозалыЛеваяКолонка);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = стрОстатокНаСкладе.Склад;
		
		Элемент = Элементы.Добавить(ИмяЭлемента + "Количество", Тип("ДекорацияФормы"), Элементы.ГруппаОстаткиДемозалыПраваяКолонка);
		Элемент.Вид = ВидДекорацииФормы.Надпись;
		Элемент.Заголовок = СтрШаблон(" - %1", стрОстатокНаСкладе.ВНаличииОстаток);
		
	КонецЦикла;
	
	ТекущаяСтрокаСписка = ТекущееОборудование;
	
	Если ЗначениеЗаполнено(ТекущееОборудование.Номенклатура) Тогда
		
		Элементы.СтраницаХарактеристики.Видимость = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	СмартЗначенияСвойствФильтров.ВидСвойств КАК Свойство,
		|	ВЫБОР
		|		КОГДА СмартЗначенияСвойствФильтров.ВидСвойств.Множественное
		|			ТОГДА СмартЗначенияСвойствФильтров.ЗначениеСтрока
		|		ИНАЧЕ СмартЗначенияСвойствФильтров.Значение
		|	КОНЕЦ КАК Значение
		|ИЗ
		|	РегистрСведений.СмартЗначенияСвойствФильтров КАК СмартЗначенияСвойствФильтров
		|ГДЕ
		|	СмартЗначенияСвойствФильтров.НаборСвойств = &НаборСвойств
		|	И НЕ ВЫБОР
		|				КОГДА СмартЗначенияСвойствФильтров.ВидСвойств.Множественное
		|					ТОГДА СмартЗначенияСвойствФильтров.ЗначениеСтрока
		|				ИНАЧЕ СмартЗначенияСвойствФильтров.Значение
		|			КОНЕЦ В ("""", ЗНАЧЕНИЕ(Справочник.СмартДопФильтрыНоменклатуры.ПустаяСсылка), НЕОПРЕДЕЛЕНО)
		|	И НЕ СмартЗначенияСвойствФильтров.ВидСвойств.Код = ""000000020""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СмартЗначенияСвойствФильтров.ЗначениеСтрока КАК ОбластьПрименения
		|ИЗ
		|	РегистрСведений.СмартЗначенияСвойствФильтров КАК СмартЗначенияСвойствФильтров
		|ГДЕ
		|	СмартЗначенияСвойствФильтров.НаборСвойств = &НаборСвойств
		|	И СмартЗначенияСвойствФильтров.ВидСвойств.Код = ""000000020""";
		
		Запрос.УстановитьПараметр("НаборСвойств", ТекущееОборудование.Номенклатура);
		
		Пакет = Запрос.ВыполнитьПакет();
		
		ТаблицаДопФильтров.Загрузить(Пакет[0].Выгрузить());
		ТаблицаОбластиПрименения.Очистить();
		
		Выборка = Пакет[1].Выбрать();
		Если Выборка.Следующий() Тогда
			
			МассивОбластей = СтрРазделить(Выборка.ОбластьПрименения, ";");
			Для каждого стрОбласть Из МассивОбластей Цикл
				
				НоваяСтрока = ТаблицаОбластиПрименения.Добавить();
				НоваяСтрока.ОбластьПрименения = стрОбласть;
				
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		ТаблицаДопФильтров.Очистить();
		ТаблицаОбластиПрименения.Очистить();
		Элементы.СтраницаХарактеристики.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиОборудованияВДемоЗалах(Оборудование)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СвободныеОстаткиОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	|	СвободныеОстаткиОстатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.СвободныеОстатки.Остатки(
	|			,
	|			Номенклатура = &Номенклатура
	|				И Склад.смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ДемоЗал)) КАК СвободныеОстаткиОстатки";
	
	Запрос.УстановитьПараметр("Номенклатура", Оборудование.Номенклатура);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ОчиститьКП()
	
	ТаблицаНоменклатурыКП.Очистить();
	СопутствующиеТовары.Очистить();
	ДополнительныеОпции.Очистить();
	СпринтерФорматыПринтеров.Очистить();
	СпринтерПечатающиеГоловки.Очистить();
	СпринтерКоличествоГолов = 0;
	СпринтерНужноЛиПечататьГлянец = Ложь;
	СпринтерОсновныеКонфигурации.Очистить();
	СпринтерЦветовыеКонфигурации.Очистить();
	ВыбранноеОборудование = Неопределено;
	ВыбраннаяПечатающаяГоловка = Неопределено;
	ВыбраннаяЦветоваяКонфигурация = Неопределено;
	ВыбранныйФорматПринтера = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКонфигураторСпринтер(НеОбнулятьВыбор = Ложь)
	
	ВыбраннаяЦветоваяКонфигурация = Неопределено;
		
	Если НЕ НеОбнулятьВыбор Тогда
		
		ВыбранныйФорматПринтера = Неопределено;
		ВыбраннаяПечатающаяГоловка = Неопределено;
		ВыбранноеОборудование = Неопределено;
		
		Для каждого стр Из СпринтерФорматыПринтеров Цикл
			Если стр.Выбрано Тогда
				ВыбранныйФорматПринтера = стр.ФорматПринтера;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого стр Из СпринтерПечатающиеГоловки Цикл
			Если стр.Выбрано Тогда
				ВыбраннаяПечатающаяГоловка = стр.ПечатающаяГоловка;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого стр Из СпринтерОсновныеКонфигурации Цикл
			Если стр.Выбрано Тогда
				ВыбранноеОборудование = стр.ОсновнаяКонфигурация;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВыбранноеОборудование.ФорматПринтера <> ВыбранныйФорматПринтера Тогда
		ВыбранноеОборудование = Неопределено;
	КонецЕсли;
	
	Для каждого стр Из СпринтерЦветовыеКонфигурации Цикл
		Если стр.Выбрано Тогда
			ВыбраннаяЦветоваяКонфигурация = стр.ЦветоваяКонфигурация;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьДоступныеВариантыВыбораКонфигуратораСпринтер();
	
	ОбновитьИнформациюПоПечатнымГоловкам();
	
	ПроверитьСкорректироватьКоличествоГолов();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДоступныеВариантыВыбораКонфигуратораСпринтер()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартКонструкторОборудования.ФорматПринтера КАК ФорматПринтера,
	|	ИСТИНА КАК Доступно,
	|	ВЫБОР
	|		КОГДА смартКонструкторОборудования.ФорматПринтера = &ВыбранныйФорматПринтера
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Выбрано
	|ИЗ
	|	Справочник.смартКонструкторОборудования КАК смартКонструкторОборудования
	|ГДЕ
	|	НЕ смартКонструкторОборудования.ПометкаУдаления
	|	И смартКонструкторОборудования.Бренд = &Бренд
	|	И смартКонструкторОборудования.ОсновнаяКонфигурация
	|	И смартКонструкторОборудования.ВидОборудования = ЗНАЧЕНИЕ(Справочник.смартВидыОборудования.ДляПечати)
	|
	|УПОРЯДОЧИТЬ ПО
	|	смартКонструкторОборудования.ФорматПринтера.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПечатающиеГоловки.ПечатающаяГоловка КАК ПечатающаяГоловка,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ПечатающиеГоловки.Ссылка.ФорматПринтера = &ВыбранныйФорматПринтера
	|					И ВЫБОР
	|						КОГДА ПечатающиеГоловки.Ссылка = &ВыбранноеОборудование
	|								ИЛИ &ВыбранноеОборудование = ЗНАЧЕНИЕ(Справочник.смартКонструкторОборудования.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Доступно,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ПечатающиеГоловки.Ссылка.ФорматПринтера = &ВыбранныйФорматПринтера
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					И ПечатающиеГоловки.ПечатающаяГоловка = &ВыбраннаяПечатающаяГоловка
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выбрано,
	|	ПечатающиеГоловки.ПечатающаяГоловка.Цена КАК Цена,
	|	ПечатающиеГоловки.ПечатающаяГоловка.Валюта КАК Валюта
	|ИЗ
	|	Справочник.смартКонструкторОборудования.ПечатающиеГоловки КАК ПечатающиеГоловки
	|ГДЕ
	|	НЕ ПечатающиеГоловки.Ссылка.ПометкаУдаления
	|	И ПечатающиеГоловки.Ссылка.Бренд = &Бренд
	|	И ПечатающиеГоловки.Ссылка.ОсновнаяКонфигурация
	|	И ПечатающиеГоловки.Ссылка.ВидОборудования = ЗНАЧЕНИЕ(Справочник.смартВидыОборудования.ДляПечати)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПечатающиеГоловки.ПечатающаяГоловка,
	|	ПечатающиеГоловки.ПечатающаяГоловка.Цена,
	|	ПечатающиеГоловки.ПечатающаяГоловка.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доступно УБЫВ,
	|	ПечатающиеГоловки.ПечатающаяГоловка.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартКонструкторОборудования.Ссылка КАК ОсновнаяКонфигурация,
	|	МАКСИМУМ(смартКонструкторОборудования.Цена) КАК Цена,
	|	МАКСИМУМ(смартКонструкторОборудования.Валюта) КАК Валюта,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА смартКонструкторОборудования.ФорматПринтера = &ВыбранныйФорматПринтера
	|					И (ПечатающиеГоловкиОборудования.ПечатающаяГоловка = &ВыбраннаяПечатающаяГоловка
	|						ИЛИ &ВыбраннаяПечатающаяГоловка = ЗНАЧЕНИЕ(Справочник.смартПечатающиеГоловки.ПустаяСсылка)
	|							И смартКонструкторОборудования.Ссылка = &ВыбранноеОборудование)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Доступно,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА смартКонструкторОборудования.ФорматПринтера = &ВыбранныйФорматПринтера
	|								И (ПечатающиеГоловкиОборудования.ПечатающаяГоловка = &ВыбраннаяПечатающаяГоловка
	|									ИЛИ &ВыбраннаяПечатающаяГоловка = ЗНАЧЕНИЕ(Справочник.смартПечатающиеГоловки.ПустаяСсылка)
	|										И смартКонструкторОборудования.Ссылка = &ВыбранноеОборудование)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					И смартКонструкторОборудования.Ссылка = &ВыбранноеОборудование
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выбрано
	|ИЗ
	|	Справочник.смартКонструкторОборудования КАК смартКонструкторОборудования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.смартКонструкторОборудования.ПечатающиеГоловки КАК ПечатающиеГоловкиОборудования
	|		ПО (ПечатающиеГоловкиОборудования.Ссылка = смартКонструкторОборудования.Ссылка)
	|ГДЕ
	|	смартКонструкторОборудования.Бренд = &Бренд
	|
	|СГРУППИРОВАТЬ ПО
	|	смартКонструкторОборудования.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доступно УБЫВ,
	|	смартКонструкторОборудования.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЦветовыеСхемы.ЦветоваяСхема КАК ЦветоваяКонфигурация,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ЦветовыеСхемы.Ссылка.ФорматПринтера = &ВыбранныйФорматПринтера
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Доступно,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ВЫБОР
	|						КОГДА ЦветовыеСхемы.Ссылка.ФорматПринтера = &ВыбранныйФорматПринтера
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					И ЦветовыеСхемы.ЦветоваяСхема = &ВыбраннаяЦветоваяКонфигурация
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК Выбрано,
	|	ЦветовыеСхемы.ВозможенГлянец КАК ВозможенГлянец,
	|	ЦветовыеСхемы.ГлянецОт КАК ГлянецОт,
	|	ЦветовыеСхемы.ГлянецДо КАК ГлянецДо,
	|	ЦветовыеСхемы.БезГлянцаОт КАК БезГлянцаОт,
	|	ЦветовыеСхемы.БезГлянцаДо КАК БезГлянцаДо
	|ИЗ
	|	Справочник.смартКонструкторОборудования.ЦветовыеСхемы КАК ЦветовыеСхемы
	|ГДЕ
	|	НЕ ЦветовыеСхемы.Ссылка.ПометкаУдаления
	|	И ЦветовыеСхемы.Ссылка.Бренд = &Бренд
	|	И ЦветовыеСхемы.Ссылка.ОсновнаяКонфигурация
	|	И ЦветовыеСхемы.Ссылка.ВидОборудования = ЗНАЧЕНИЕ(Справочник.смартВидыОборудования.ДляПечати)
	|	И ЦветовыеСхемы.Ссылка = &ВыбранноеОборудование
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦветовыеСхемы.ЦветоваяСхема,
	|	ЦветовыеСхемы.ВозможенГлянец,
	|	ЦветовыеСхемы.ГлянецОт,
	|	ЦветовыеСхемы.ГлянецДо,
	|	ЦветовыеСхемы.БезГлянцаОт,
	|	ЦветовыеСхемы.БезГлянцаДо
	|
	|УПОРЯДОЧИТЬ ПО
	|	Доступно УБЫВ,
	|	ЦветовыеСхемы.ЦветоваяСхема.Наименование";
	
	Запрос.УстановитьПараметр("Бренд", ПолучитьБрендСпринтер());
	Запрос.УстановитьПараметр("ВыбранныйФорматПринтера", ВыбранныйФорматПринтера);
	Запрос.УстановитьПараметр("ВыбраннаяПечатающаяГоловка", ВыбраннаяПечатающаяГоловка);
	Запрос.УстановитьПараметр("ВыбранноеОборудование", ВыбранноеОборудование);
	Запрос.УстановитьПараметр("ВыбраннаяЦветоваяКонфигурация", ВыбраннаяЦветоваяКонфигурация);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	СпринтерФорматыПринтеров.Загрузить(Пакет[0].Выгрузить());
	СпринтерПечатающиеГоловки.Загрузить(Пакет[1].Выгрузить());
	СпринтерОсновныеКонфигурации.Загрузить(Пакет[2].Выгрузить());
	СпринтерЦветовыеКонфигурации.Загрузить(Пакет[3].Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ВыборДоступногоОборудованияСервер()
	
	ВыбранноеОборудование = Элементы.СписокДоступногоОборудования.ТекущаяСтрока;
	ВыбранныйФорматПринтера = ВыбранноеОборудование.ФорматПринтера;
	ВыбраннаяПечатающаяГоловка = ВыбранноеОборудование.ПечатающаяГоловка;
	
	Если ВыбранноеОборудование.Бренд = ПолучитьБрендСпринтер() Тогда
		
		ОбновитьКонфигураторСпринтер(Истина);
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКонфигураторСпринтер;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБрендСпринтер()
	
	Возврат Справочники.смартПредопределенныеЗначения.Настройки.БрендСпринтер;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьКартинкуДополнительныхОпцийНаФормеКлиент()
	
	ОбновитьКартинкуДополнительныхОпцийНаФорме();
	
КонецПроцедуры
	
&НаСервере
Процедура ОбновитьКартинкуДополнительныхОпцийНаФорме()
	
	Если Элементы.ДополнительныеОпции.ТекущаяСтрока = Неопределено Тогда
		АдресКартинкиДополнительныеОпции = "";
		Элементы.ДополнительныеОпцииОписание.Заголовок = "";
		Возврат;
	КонецЕсли;
	
	Данные = ДополнительныеОпции.НайтиПоИдентификатору(Элементы.ДополнительныеОпции.ТекущаяСтрока);
	Если ТипЗнч(Данные.Номенклатура) = Тип("Строка") Тогда
		АдресКартинкиДополнительныеОпции = "";
		Элементы.ДополнительныеОпцииОписание.Заголовок = "";
		Возврат
	ИначеЕсли ТипЗнч(Данные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если НЕ Элементы.ДополнительныеОпцииОписание.Заголовок = Данные.Номенклатура.Описание Тогда
			Элементы.ДополнительныеОпцииОписание.Заголовок = Данные.Номенклатура.Описание;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные.Номенклатура) = Тип("СправочникСсылка.смартКонструкторОборудования") Тогда
		Если НЕ Элементы.ДополнительныеОпцииОписание.Заголовок = Данные.Номенклатура.Описание Тогда
			Элементы.ДополнительныеОпцииОписание.Заголовок = Данные.Номенклатура.Описание;
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Номенклатура.ФайлКартинки.Пустая() Тогда
		АдресКартинкиДополнительныеОпции = "";
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			АдресКартинкиДополнительныеОпции = РаботаСФайлами.ДанныеФайла(Данные.Номенклатура.ФайлКартинки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинкиДополнительныеОпции = "";
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинкуСопутствующихТоваровНаФормеКлиент()
	
	ОбновитьКартинкуСопутствующихТоваровНаФорме();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуСопутствующихТоваровНаФорме()
	
	Если Элементы.СопутствующиеТовары.ТекущаяСтрока = Неопределено Тогда
		Элементы.СопутствующиеТоварыОписание.Заголовок = "";
		АдресКартинкиСопутствующиеТовары = "";
		Возврат;
	КонецЕсли;
	
	Данные = СопутствующиеТовары.НайтиПоИдентификатору(Элементы.СопутствующиеТовары.ТекущаяСтрока);
	Если ТипЗнч(Данные.Номенклатура) = Тип("Строка") Тогда
		Элементы.СопутствующиеТоварыОписание.Заголовок = "";
		АдресКартинкиСопутствующиеТовары = "";
		Возврат;
	ИначеЕсли ТипЗнч(Данные.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		Если НЕ Элементы.СопутствующиеТоварыОписание.Заголовок = Данные.Номенклатура.Описание Тогда
			Элементы.СопутствующиеТоварыОписание.Заголовок = Данные.Номенклатура.Описание;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные.Номенклатура) = Тип("СправочникСсылка.смартКонструкторОборудования") Тогда
		Если НЕ Элементы.СопутствующиеТоварыОписание.Заголовок = Данные.Номенклатура.Описание Тогда
			Элементы.СопутствующиеТоварыОписание.Заголовок = Данные.Номенклатура.Описание;
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.Номенклатура.ФайлКартинки.Пустая() Тогда
		АдресКартинкиСопутствующиеТовары = "";
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			АдресКартинкиСопутствующиеТовары = РаботаСФайлами.ДанныеФайла(Данные.Номенклатура.ФайлКартинки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинкиСопутствующиеТовары = "";
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартинкуПечатающейГоловкиНаФорме()
	
	Если ВыбранноеОборудование.Пустая() Тогда
		АдресКартинкиПечатающейГоловки = "";
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеОборудование.ФайлКартинкиПечатающейГоловки.Пустая() Тогда
		АдресКартинкиПечатающейГоловки = "";
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		Попытка
			АдресКартинкиПечатающейГоловки = РаботаСФайлами.ДанныеФайла(ВыбранноеОборудование.ФайлКартинкиПечатающейГоловки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Исключение
			АдресКартинкиПечатающейГоловки = "";
		КонецПопытки;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииКПКлиентСервер()
	
	Если ЗначениеЗаполнено(КПКлиент) Тогда
		КППартнер = КПКлиент.Партнер;
		УстановитьВидимостьДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговоеКП()
	
	ТаблицаНоменклатурыКП.Очистить();
	
	Если Элементы.СтраницаКонфигураторСпринтер.Видимость Тогда
		
		ЦенаОсновнойКонфигурацииСпринтер = 0;
		
		Для каждого стр Из СпринтерПечатающиеГоловки Цикл
			
			Если стр.Выбрано Тогда
				
				НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
				НоваяСтрокаКП.Номенклатура = стр.ПечатающаяГоловка;
				НоваяСтрокаКП.Количество = СпринтерКоличествоГолов;
				НоваяСтрокаКП.Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(стр.Цена, стр.Валюта, Валюта, ТекущаяДатаСеанса());
				НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого стр Из СпринтерОсновныеКонфигурации Цикл
			
			Если стр.Выбрано Тогда
				
				ЦенаОсновнойКонфигурацииСпринтер = ЦенаОсновнойКонфигурацииСпринтер + РаботаСКурсамиВалют.ПересчитатьВВалюту(стр.Цена, стр.Валюта, Валюта, ТекущаяДатаСеанса());
				
				НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
				НоваяСтрокаКП.Номенклатура = стр.ОсновнаяКонфигурация;
				НоваяСтрокаКП.Количество = 1;
				НоваяСтрокаКП.Цена = ЦенаОсновнойКонфигурацииСпринтер;
				НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
				
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
		
		//Если СпринтерНужноЛиПечататьГлянец Тогда
		//	
		//	НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
		//	НоваяСтрокаКП.Номенклатура = "LED блок";
		//	НоваяСтрокаКП.Количество = 1;
		//	НоваяСтрокаКП.Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(3200, Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD.ВалютаЦены, Валюта, ТекущаяДатаСеанса());
		//	НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
		//	
		//КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ВыбранноеОборудование) И ЗначениеЗаполнено(ВыбранноеОборудование.Номенклатура) Тогда
			
			Цены = ПолучитьЦеныНоменклатуры(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВыбранноеОборудование.Номенклатура));
			
			НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
			НоваяСтрокаКП.Номенклатура = ВыбранноеОборудование.Номенклатура;
			НоваяСтрокаКП.Количество = 1;
			НоваяСтрокаКП.Цена = ?(Цены.Количество() > 0, РаботаСКурсамиВалют.ПересчитатьВВалюту(Цены[0].Цена, Цены[0].Валюта, Валюта, ТекущаяДатаСеанса()), 0);
			НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого стр Из СопутствующиеТовары Цикл
		
		Если стр.Выбрано И НЕ стр.Номенклатура = "Не выбрано" Тогда
			
			НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
			НоваяСтрокаКП.Номенклатура = стр.Номенклатура;
			НоваяСтрокаКП.Количество = 1;
			НоваяСтрокаКП.Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(стр.Цена, стр.Валюта, Валюта, ТекущаяДатаСеанса());
			НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стр Из ДополнительныеОпции Цикл
		
		Если стр.Выбрано И НЕ стр.Номенклатура = "Не выбрано" Тогда
			
			НоваяСтрокаКП = ТаблицаНоменклатурыКП.Добавить();
			НоваяСтрокаКП.Номенклатура = стр.Номенклатура;
			НоваяСтрокаКП.Количество = 1;
			НоваяСтрокаКП.Цена = РаботаСКурсамиВалют.ПересчитатьВВалюту(стр.Цена, стр.Валюта, Валюта, ТекущаяДатаСеанса());
			НоваяСтрокаКП.Стоимость = НоваяСтрокаКП.Цена * НоваяСтрокаКП.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
	СуммаКП = ТаблицаНоменклатурыКП.Итог("Стоимость");
	Элементы.ТаблицаНоменклатурыКПСтоимость.ТекстПодвала = Формат("ЧДЦ=2");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьСопутствующиеТоварыИДополнительныеОпции()
	
	ПредыдущиеДанные = СопутствующиеТовары.Выгрузить();
	МассивНоменклатуры = Новый Массив;
	
	СопутствующиеТовары.Очистить();
	НоваяСтрока = СопутствующиеТовары.Добавить();
	НоваяСтрока.Номенклатура = "Не выбрано";
		
	ДополнительныеОпции.Очистить();
	НоваяСтрока = ДополнительныеОпции.Добавить();
	НоваяСтрока.Номенклатура = "Не выбрано";
	
	Для каждого стрДанные Из ВыбранноеОборудование.СопутствующиеТовары Цикл
		
		НоваяСтрока = СопутствующиеТовары.Добавить();
		НоваяСтрока.Номенклатура = стрДанные.Номенклатура;
		
		Если ТипЗнч(стрДанные.Номенклатура) = Тип("СправочникСсылка.смартКонструкторОборудования") Тогда
			
			НоваяСтрока.Цена = стрДанные.Номенклатура.Цена;
			НоваяСтрока.Валюта = стрДанные.Номенклатура.Валюта;
			
		Иначе
			МассивНоменклатуры.Добавить(стрДанные.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого стрДанные Из ВыбранноеОборудование.ДополнительныеОпции Цикл
		
		НоваяСтрока = ДополнительныеОпции.Добавить();
		НоваяСтрока.Номенклатура = стрДанные.Номенклатура;
		
		Если ТипЗнч(стрДанные.Номенклатура) = Тип("СправочникСсылка.смартКонструкторОборудования") Тогда
			
			НоваяСтрока.Цена = стрДанные.Номенклатура.Цена;
			НоваяСтрока.Валюта = стрДанные.Номенклатура.Валюта;
			
		Иначе
			МассивНоменклатуры.Добавить(стрДанные.Номенклатура);
		КонецЕсли;
		
	КонецЦикла;
	
	ЦеныНоменклатуры = ПолучитьЦеныНоменклатуры(МассивНоменклатуры);
	Для каждого стрЦена Из ЦеныНоменклатуры Цикл
		
		НайденныеСтроки = СопутствующиеТовары.НайтиСтроки(Новый Структура("Номенклатура", стрЦена.Номенклатура));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			стрНайденныеСтроки.Цена = стрЦена.Цена;
			стрНайденныеСтроки.Валюта = стрЦена.Валюта;
		КонецЦикла;
		
		НайденныеСтроки = ДополнительныеОпции.НайтиСтроки(Новый Структура("Номенклатура", стрЦена.Номенклатура));
		Для каждого стрНайденныеСтроки Из НайденныеСтроки Цикл
			стрНайденныеСтроки.Цена = стрЦена.Цена;
			стрНайденныеСтроки.Валюта = стрЦена.Валюта;
		КонецЦикла;
		
	КонецЦикла;
	
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьЦеныНоменклатуры(МассивНоменклатуры)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ВидЦены.ВалютаЦены КАК Валюта
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура В (&МассивНоменклатуры)
	|				И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	Запрос.УстановитьПараметр("ВидЦены", Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Процедура ОбновитьИнформациюПоПечатнымГоловкам()
	
	Элементы.СпринтерНужноЛиПечататьГлянец.Видимость = Ложь;
	НайденныеСтроки = СпринтерЦветовыеКонфигурации.НайтиСтроки(Новый Структура("Выбрано", Истина));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Элементы.ГруппаСпринтерКоличествоГолов.Видимость = Истина;
		
		Если НайденныеСтроки[0].ВозможенГлянец Тогда
			Элементы.СпринтерНужноЛиПечататьГлянец.Видимость = Истина;
		Иначе
			СпринтерНужноЛиПечататьГлянец = Ложь;
		КонецЕсли;
		
		МинимальноеКоличество = 0;
		МаксимальноеКоличество = 0;
		
		Если СпринтерНужноЛиПечататьГлянец Тогда
			
			Элементы.ДекорацияМинимумГолов.Заголовок = СтрШаблон("от %1", НайденныеСтроки[0].ГлянецОт);
			Элементы.ДекорацияМаксимумГолов.Заголовок = СтрШаблон("до %1", НайденныеСтроки[0].ГлянецДо);
			
			МинимальноеКоличество = НайденныеСтроки[0].ГлянецОт;
			МаксимальноеКоличество = НайденныеСтроки[0].ГлянецДо;
			
		Иначе
			
			Элементы.ДекорацияМинимумГолов.Заголовок = СтрШаблон("от %1", НайденныеСтроки[0].БезГлянцаОт);
			Элементы.ДекорацияМаксимумГолов.Заголовок = СтрШаблон("до %1", НайденныеСтроки[0].БезГлянцаДо);
			
			МинимальноеКоличество = НайденныеСтроки[0].БезГлянцаОт;
			МаксимальноеКоличество = НайденныеСтроки[0].БезГлянцаДо;
			
		КонецЕсли;
		
		Элементы.СпринтерКоличествоГолов.СписокВыбора.Очистить();
		Элементы.СпринтерКоличествоГолов.СписокВыбора.Добавить(0, "0");
		Для н = МинимальноеКоличество По МаксимальноеКоличество Цикл
			Если НЕ н = 0 Тогда
				Элементы.СпринтерКоличествоГолов.СписокВыбора.Добавить(н, н);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Элементы.ГруппаСпринтерКоличествоГолов.Видимость = Ложь;
		СпринтерНужноЛиПечататьГлянец = Ложь;
	КонецЕсли;
	
	НайденныеСтроки = ДополнительныеОпции.НайтиСтроки(Новый Структура("Номенклатура", "LED блок"));
	Если СпринтерНужноЛиПечататьГлянец И НайденныеСтроки.Количество() = 0 Тогда
		
		НоваяСтрока = ДополнительныеОпции.Добавить();
		НоваяСтрока.Номенклатура = "LED блок";
		НоваяСтрока.Цена = 3200;
		НоваяСтрока.Валюта = Справочники.смартПредопределенныеЗначения.Настройки.ВидЦеныРозничнаяUSD.ВалютаЦены;
		НоваяСтрока.Выбрано = Истина;
		НоваяСтрока.Доступно = Истина;
		
	ИначеЕсли НЕ СпринтерНужноЛиПечататьГлянец И НЕ НайденныеСтроки.Количество() = 0 Тогда
		
		ДополнительныеОпции.Удалить(НайденныеСтроки[0]);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьСкорректироватьКоличествоГолов()
	
	Если СпринтерКоличествоГолов = 0 Тогда
		Возврат;
	КонецЕсли;
	
	НайденныеСтроки = СпринтерЦветовыеКонфигурации.НайтиСтроки(Новый Структура("Выбрано", Истина));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Если СпринтерНужноЛиПечататьГлянец Тогда
			
			СпринтерКоличествоГолов = Мин(СпринтерКоличествоГолов, НайденныеСтроки[0].ГлянецДо);
			СпринтерКоличествоГолов = Макс(СпринтерКоличествоГолов, НайденныеСтроки[0].ГлянецОт);
			
		Иначе
			
			СпринтерКоличествоГолов = Мин(СпринтерКоличествоГолов, НайденныеСтроки[0].БезГлянцаДо);
			СпринтерКоличествоГолов = Макс(СпринтерКоличествоГолов, НайденныеСтроки[0].БезГлянцаОт);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступностьСтраницИВозможностиПерехода()
	
	ДоступностьПредыдущих = Истина;
	
	//дополнительные опции
	Элементы.СтраницаДополнительныеОпции.Доступность = ЗначениеЗаполнено(ВыбранноеОборудование) И НЕ Элементы.СтраницаКонфигураторСпринтер.Видимость;
	Если НЕ Элементы.СтраницаДополнительныеОпции.Доступность И Элементы.СтраницаКонфигураторСпринтер.Видимость Тогда
		
		ВыделенныеСтроки = СпринтерФорматыПринтеров.Выгрузить(Новый Структура("Выбрано", Истина));
		Элементы.СтраницаДополнительныеОпции.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
		
		Если Элементы.СтраницаДополнительныеОпции.Доступность Тогда
			ВыделенныеСтроки = СпринтерПечатающиеГоловки.Выгрузить(Новый Структура("Выбрано", Истина));
			Элементы.СтраницаДополнительныеОпции.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
		КонецЕсли;
		
		Если Элементы.СтраницаДополнительныеОпции.Доступность Тогда
			ВыделенныеСтроки = СпринтерПечатающиеГоловки.Выгрузить(Новый Структура("Выбрано", Истина));
			Элементы.СтраницаДополнительныеОпции.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
		КонецЕсли;
		
		Если Элементы.СтраницаДополнительныеОпции.Доступность Тогда
			ВыделенныеСтроки = СпринтерОсновныеКонфигурации.Выгрузить(Новый Структура("Выбрано", Истина));
			Элементы.СтраницаДополнительныеОпции.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
		КонецЕсли;
		
		Если Элементы.СтраницаДополнительныеОпции.Доступность Тогда
			ВыделенныеСтроки = СпринтерЦветовыеКонфигурации.Выгрузить(Новый Структура("Выбрано", Истина));
			Элементы.СтраницаДополнительныеОпции.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
		КонецЕсли;
		
		Если Элементы.СтраницаДополнительныеОпции.Доступность Тогда
			Элементы.СтраницаДополнительныеОпции.Доступность = (СпринтерКоличествоГолов > 0) И ДоступностьПредыдущих;
		КонецЕсли;
		
		Элементы.КнопкаДалееСпринтер.Доступность = Элементы.СтраницаДополнительныеОпции.Доступность;
		
	КонецЕсли;
	ДоступностьПредыдущих = Элементы.СтраницаДополнительныеОпции.Доступность;
	
	//сопутствующие товары
	ВыделенныеСтроки = ДополнительныеОпции.Выгрузить(Новый Структура("Выбрано", Истина));
	Элементы.СтраницаСопутствующиеТовары.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
	ДоступностьПредыдущих = Элементы.СтраницаСопутствующиеТовары.Доступность;
	Элементы.КнопкаДалееДополнительныеОпции.Доступность = Элементы.СтраницаСопутствующиеТовары.Доступность;
	
	//КП клиента
	ВыделенныеСтроки = СопутствующиеТовары.Выгрузить(Новый Структура("Выбрано", Истина));
	Элементы.СтраницаКПКлиента.Доступность = (ВыделенныеСтроки.Количество() > 0) И ДоступностьПредыдущих;
	Элементы.КнопкаДалееСопутствующиеТовары.Доступность = Элементы.СтраницаКПКлиента.Доступность;
	
	Элементы.СтраницаКПКлиента.Доступность = Истина; //пока не определятся аналитики
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКППоТекущимДанным()
	
	УстановитьПривилегированныйРежим(Истина);
	
	КП = Документы.КоммерческоеПредложениеКлиенту.СоздатьДокумент();
	
	КП.Дата = ТекущаяДатаСеанса();
	КП.Организация = Справочники.смартПредопределенныеЗначения.ОрганизацияБитрикс.Значение;
	КП.Автор = Пользователи.АвторизованныйПользователь();
	КП.CRM_Автор = КП.Автор;
	КП.Менеджер = КПМенеджер;
	КП.Клиент = КППартнер;
	КП.Контрагент = КПКлиент;
	КП.КонтактноеЛицо = КПКонтактноеЛицо;
	КП.Валюта = Валюта;
	КП.ХозяйственнаяОперация = Перечисления.ВидыОперацийКоммерческихПредложений.ЗакупкаУПоставщика;
	КП.ВариантУказанияСрокаПоставки = Перечисления.ВариантыСроковПоставкиКоммерческихПредложений.НеУказывается;
	КП.Налогообложение = Истина;
	КП.СкидкиРассчитаны = Истина;
	КП.СрокДействия = КП.Дата + 86400 * 3;
	КП.Статус = Перечисления.СтатусыКоммерческихПредложенийКлиентам.Черновик;
	КП.СуммаДокумента = СуммаКП;
	КП.ЦенаВключаетНДС = Истина;
	
	СтрокаВарианта = КП.CRM_КомментарииВариантов.Добавить();
	СтрокаВарианта.ИДВарианта = 1;
	СтрокаВарианта.КомментарийВарианта = "Основной";
	
	Для каждого стрТовары Из ТаблицаНоменклатурыКП Цикл
		
		НоваяСтрока = КП.Товары.Добавить();
		НоваяСтрока.Номенклатура = стрТовары.Номенклатура;
		НоваяСтрока.CRM_Содержание = стрТовары.Номенклатура;
		НоваяСтрока.Количество = стрТовары.Количество;
		НоваяСтрока.Цена = стрТовары.Цена;
		НоваяСтрока.Сумма = стрТовары.Стоимость;
		НоваяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
		НоваяСтрока.СуммаСНДС = стрТовары.Стоимость;
		
		НоваяСтрока.CRM_ИДВарианта = СтрокаВарианта.ИДВарианта;
		НоваяСтрока.CRM_ИмяВарианта = СтрокаВарианта.КомментарийВарианта;
		
	КонецЦикла;
	
	КП.Записать(РежимЗаписиДокумента.Запись);
	Попытка
		КП.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ОчиститьКП();
	УстановитьВидимостьДоступность();
	ОбновитьДоступностьСтраницИВозможностиПерехода();
	
КонецПроцедуры


#КонецОбласти
